Revit 2027 API
FailureDefinition.GetDefaultResolutionType Method
 Retrieves the default resolution type for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureResolutionType GetDefaultResolutionType()
Public Function GetDefaultResolutionType As FailureResolutionType
public:
FailureResolutionType GetDefaultResolutionType()
member GetDefaultResolutionType : unit -> FailureResolutionType
Return Value
FailureResolutionType
 The Default resolution type for the failure.
Exceptions
Exception | Condition
InvalidOperationException |  FailureDefinition does not have any resolutions.
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace